# set up brew cask
tap "caskroom/cask"
tap "caskroom/fonts"
tap "caskroom/drivers"
tap "luckyframework/homebrew-lucky"

# brew installs
brew "zsh"
brew "zsh-completions"
brew "git"
brew "mas"
brew "sqlite"
brew "wget"
brew "heroku"
brew "rbenv"
brew "python"
brew "crystal-lang"
brew "amber"
brew "lucky"
brew "node"
brew "yarn"
brew "task"
brew "bdw-gc"
brew "gmp"
brew "libevent"
brew "libxml2"
brew "libyaml"
brew "llvm"
brew "tig"

# brew cask install dev-tools
cask "iterm2"
cask "dash"
cask "postman"
cask "sourcetree"
cask "visual-studio-code"
cask "xquartz"
cask "sequel-pro"
cask "virtualbox"
cask "docker"
cask "github"
cask "gitup"

# brew cask install apps
cask "tunnelbear"
cask "spotify"
cask "laverna"
cask "bitbar"
cask "caret"
cask "popclip"
cask "yakyak"
cask "slack"
cask "boom-3d"
cask "alfred"

# brew cask install browsers
cask "google-chrome"

# brew cask install drivers
cask "logitech-options"

# brew cask install fonts
cask "font-fira-code"

# Mac Appstore
mas "Xcode", id: 497799835
mas "Pages", id: 409201541
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
